Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: Delete {group} group avatar
ha: Goge {group} hoton ƙungiya

source: Delete image
ha: Goge hoto

source: Delete image | {t} | Media Gallery
ha: Goge hoto | {t} Ma'ajiyar Hotuna

source: Delete message
ha: Goge saƙo

source: Delete Message
ha: Goge saƙo

source: Delete messages?
ha: Goge saƙwanni?

source: Delete My Account
ha: Goge Asusuna

source: Delete Post
ha: Goge Aike

source: Delete Post | {t} | {d} Discussion | Knowledge Base
ha: Goge aike | {t} | {d} Tattaunawa | Tushen Ilimi

source: Delete question
ha: Goge tambaya

source: Delete Question | {t} | Firefox Support Forum
ha: Goge Tambaya | {t} | Dandalin Tallafi na Firefox

source: Delete Revision
ha: Gode Nazari

source: Delete Revision | {document}
ha: Goge Nazari | {document}

source: Delete Selected
ha: Goge waɗanda aka zaɓa

source: Delete selected images
ha: Goge hotunan da aka zaɓa

source: Delete this document
ha: Goge wannan daftari

source: Delete this image
ha: Goge wannan hoton

source: Delete this post
ha: Goge wannan aiken

source: Delete this question
ha: Goge wannan tambaya

source: Delete this revision
ha: Goge wannan nazarin

source: Delete this thread
ha: Goge wannan tattaunawa

source: Delete Thread
ha: Goge Tattaunawa

source: Delete Thread | {t} | {d} Discussion | Knowledge Base
ha: Goge tattaunawa | {t} | {d} Tattaunawa | Tushen Ilimi

source: Delete video
ha: Goge bidiyo

source: Delete video | {t} | Media Gallery
ha: Goge bidiyo | {t} | Ma'ajiyar Kaɗe-kaɗe

source: Deleting your account will prevent you from answering or posting questions in Mozilla Support. This action will clear your profile and cannot be restored again.
ha: Goge asusunka zai iya tsareka daga amsawa ko aika tambayoyi ga Tallafin Mozilla. Wannan aikin zai share tarihinka kuma ba za'a iya dawo da shi ba.

source: Describe your issue here.
ha: Kwatanta batunka a nan.

source: Description:
ha: Kwatance:

source: desktop
ha: fuskar kwamfuta

source: Details
ha: Cikakken bayani

source: Device:
ha: Na'ura:

source: Did not work as expected
ha: Bai yi aiki yadda aka zata ba

source: Did this answer also help you? Did you find another post more helpful? Let other Firefox users know by voting next to the answer.
ha: Wannan amsar ita ma ta taimaka maka? Ka sami wani aike wanda ya fi taimakawa? Bari sauran masu amfani da Firefox su sani ta hanyar zaɓe kusa da amsar.

source: Did this reply solve your problem?
ha: Wannan amsar ta warware matsalarka?

source: Did you know that %(answerer)s is a Firefox user just like you? Get started helping other Firefox users by <a href="https://%(host)s/questions?filter=unsolved"> browsing questions</a> -- you might just make someone's day!
ha: Ko ka san cewa %(answerer)s mai amfani da Firefox ne kamar kai? Fara taimakawa wasu masu amfani da Firefox ta <a href="https://%(host)s/questions?filter=unsolved"> browsing questions</a> -- za ka iya sa wani farin ciki!

source: Did you know that %(answerer)s is a Firefox user just like you? Get started helping other Firefox users by browsing questions at https://%(host)s/questions?filter=unsolved -- you might just make someone's day!
ha: Ko ka san cewa %(answerer)s mai amfani da Firefox ne kamar kai? Fara taimakawa sauran masu amfani da Firefox ta gewayawa tambayoyi a https://%(host)s/questions?filter=unsolved -- za ka iya saka wani farin ciki a yau!

source: Did you mean %s?
ha: Kana nufin%s?

source: Differences
ha: Bambance-bambance

source: Discuss
ha: Tattauna

source: Discussion
ha: Tattaunawa

source: Discussion Forums
ha: Dandalin Tattaunawa

source: Display
ha: Nuni

source: Display and appearance
ha: Nuni da bayyana

source: Display Badges
ha: Nuna Bajuna

source: Display name
ha: Nuna suna

source: Display your digital badges on your social networks, job sites and your own website.
ha: Nuna bajunanka na yanar gizo na haɗinka na dandalin sa-da-zumunta na yanar gizo, dandalin samar da ayyuka da kuna dandalinka na yanar gizo.

source: Do any of these articles answer your question?
ha: Akwai ɗaya daga cikin waɗan nan maƙaloli da ta amsa tambayarka?

source: Document contributors
ha: Masu bayar da gudun mawa na daftari

source: Document Deleted | {document}
ha: An goge Daftari | {document}

source: Documents
ha: Daftarori

source: Documents edited or translated
ha: An gyara kuma an fassara daftarori

source: Documents finished downloading.
ha: An gama sauke bayani.

source: Documents that include "{title}"
ha: Daftarori da su ka haɗa da "{title}"

source: Documents that link to "{title}"
ha: Daftarori da su ke da haɗi zuwa "{title}"

source: Documents that use "{title}" as a template
ha: Daftari mai amfani da "{title}" a matsayin allon misali

source: Does this reply solve the problem?
ha: Wannan amsar ta warware matsalar?

source: Do more with apps
ha: Yi abubuwa da aikace-aikace

source: Done
ha: An kammla

source: Done!
ha: An kammla!

source: DONE
ha: AN KAMMALA

source: Done! Your question is now posted on the Mozilla community support forum.
ha: An kammala. An aika tambayarka yanzu a dandalin tallafi na al'ummar Mozilla.

source: Do not disclose personal user information without the userâs consent.
ha: Ka da ka bayyana bayananka na mai amfani na tare da yardar mai amfani ba.

source: Don't filter
ha: Kada a tace

source: Don't have an account? Register
ha: Ba ka da asusu? Yi rijista

source: download
ha: sauke

source: Download a fresh copy
ha: Sauke sabon kwafi

source: Download All Documents
ha: Sauke Duk Bayanai

source: Download and install apps
ha: Sauke kuma ka saka aikace-aikace

source: Download and Manage Apps
ha: Sauke kuma ka Gudanar da Aikace-aikace

source: Download apps from the Marketplace
ha: Sauke aikace-aikace daga Marketplace

source: Download documents for offline use?
ha: Sauke bayanai domin amfani ba a kan yanar gizo ba?

source: Download, install and migration
ha: Saukewa, sakawa da ƙaura

source: Download, install and Migration
ha: Sauke, saka kuma ka yi Ƙaura

source: Earn Badges
ha: Sami Bajuna

source: Earn Badges for the skills you learn online and offline
ha: Sami Bajuna domin ƙwarewar da ka samu ta kan layi da kuma ba ta kan layi ba

source: Edit an answer
ha: Gyara amsa

source: Edit anyway
ha: Gyara duk da haka

source: Edit a post
ha: Gyara aike

source: Edit a post | {t} | {d} Discussion | Knowledge Base
ha: Gyara aike | {t} | {d} Tattaunawa | Tushen Ilimi

source: Edit a Question
ha: Gyara Tambaya

source: Edit Article
ha: Gyara Maƙala

source: Edit article based on this revision
ha: Gyara maƙala dangane da wannan nazari

source: Edit Article | {document}
ha: Gyara Maƙala | {document}

source: Edit Content
ha: Gyara abin ciki

source: Edit contributors
ha: Gyara masu bayar da gudun mawa

source: Edit Description
ha: Gyara Kwatance

source: Edit details
ha: Gyara cikakken bayani

source: Edit | {group} | Groups
ha: Gyara | {group} | Rukuni

source: Edit group leaders
ha: Gyara jagororin ƙungiya

source: Edit group members
ha: Gyara mambobin ƙungiya

source: Edit group profile
ha: Gyara tarihin ƙungiya

source: Edit {group} profile information
ha: Gyara {group} bayanin tarihi

source: Edit image
ha: Gyara hoto

source: Edit image | {t} | Media Gallery
ha: Gyara hoto | {t} | Ma'ajiyar Hotuna

source: Edit in admin
ha: Gyara a wurin gudanarwa

source: Editing an answer | {t} | Firefox Support Forum
ha: Gyara amsa | {t} | Dandalin Tallafi na Firefox

source: Editing Tools
ha: Kayayyakin Gyara

source: Edit levels are taken into account as follows:
ha: Gyara mataki ana kula da su kamar haka:

source: Edit locale editors
ha: Gyara masu nazari na wuri

source: Edit locale leaders
ha: Gyara shugabannin wuri

source: Edit locale reviewers
ha: Gyara masu nazari na wuri

source: Edit my profile
ha: Gyara tarihina

source: Editor
ha: Mai gyara

source: Edit profile
ha: Gyara tarihi

source: Edit settings
ha: Gyara saituna

source: Edit Settings
ha: Gyara Saituna

source: Edit the question
ha: Gyara Tambayar

source: Edit the question.
ha: Gyara tambayar.

source: Edit this image
ha: Gyara wannan hoto

source: Edit this post
ha: Gyara wani aiken

source: Edit this question
ha: Gyara wannan tambaya

source: Edit this thread
ha: Gyara wannan tattaunawa

source: Edit thread
ha: Gyara tattunawa

source: Edit thread "{t}"
ha: Gyara tattaunawa "{t}"

source: Edit thread {t} | {d} Discussion | Knowledge Base
ha: Gyara tattaunawa {t} | {d} Tattaunawa | Tushen Ilimi

source: Edit user profile
ha: Gyara tarihin mai amfani

source: Email:
ha: Imel:

source: Email address:
ha: Adireshin imel:

source: Email Address:
ha: Adireshin Imel:

source: Email address is required.
ha: Ana bukatar adireshin imel.

source: Email address is too long (%(show_value)s characters). It must be %(limit_value)s characters or less.
ha: Adireshin imel ya yi tsawo sosai (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: Email address is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Adireshin imel ya yi gajarta (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: Email and Messages
ha: Imel da Saƙwanni

source: Email changed for user {username}
ha: An canja imel domin mai amfani {username}

source: Email in
ha: Imel a

source: Email me article changes
ha: A yiwo min imel na canje-canjen maƙaloli

source: Emails
ha: Saƙwannin Imel

source: Email software for Windows, Mac and Linux
ha: Masarrafar imel domin Windows, Mac da Linux

source: Email updates
ha: Sabunta imel

source: <em>Editing</em> {title}
ha: <em>Gyarawa</em> {title}

source: End
ha: Ƙarshe

source: End:
ha: Ƙarshe:

source: Enhance Firefox's functionality and appearance with add-ons
ha: Haɓaka aikin Firefox da bayyana tare da abubuwan daɗi

source: Ensure this value has at least %(limit_value)s characters (it has %(show_value)s).
ha: Ka tabbatar kimar wannan na da a ƙalla %(limit_value)s haruffa (it has %(show_value)s).

source: Ensure this value has at most %(limit_value)s characters (it has %(show_value)s).
ha: Ka tabbatar kimar wannan na da a ƙalla %(limit_value)s haruffa (it has %(show_value)s).

source: Enter a subject here.
ha: Shigar da batu a nan.

source: Enter the name of the article
ha: Shigar da sunan maƙala

source: Enter the Transaction ID here.
ha: Shigar da Lambar Hulɗa a nan.

source: Enter the URL of the external link
ha: Shigar da URL na haɗin waje

source: Enter your email address here.
ha: Shigar da adireshinka na imel a nan.

source: Enter your reply here.
ha: Shigar da amsarka a nan.

source: Enter your terms in the form below and click <strong>Search</strong>
ha: Shigar da sharuɗɗanka a fom ɗin ƙasa kuma ka danna <strong>Search</strong>

source: Error deleting image
ha: Kuskuren goge hoto

source: Error loading graph
ha: Kuskure wajen loda zane

source: Error messages: what they mean and how to fix
ha: Saƙwannin kuskure: abin da suke nufi da kuma magancesu

source: Error uploading image
ha: Kuskure wajen loda hoto

source: Escalated
ha: Ya hauhawa

source: Events and help for Mentors
ha: Truka da taimako domin Mashawarta

source: Every time Firefox opened
ha: Duk lokacin da Firefox ta buɗe

source: Example:
ha: Misali:

source: Exit Survey Results
ha: Fita daga Sakamakon Nazari

source: Expiry date:
ha: Kwanan watan ƙarewa:

source: Expiry Date
ha: Kwanan watan lalacewa

source: Explanation:
ha: Bayani:

source: Explore more topics
ha: Sake gano wasu batutuwa

source: Extension/plugin you are having trouble with
ha: Faɗaɗawa/haɗawa da ka ke da matsala da su

source: Extensions
ha: Faɗaɗawa

source: External link:
ha: Haɗin waje:

source: Facebook URL
ha: URL na Facebook

source: File deleted. Please select an image file.
ha: An goge fayil. Zaɓi fayil na hoto.

source: Fill in details
ha: Cike cikakken bayani

source: Filter by
ha: Tace da

source: Filter by Locale
ha: Tace ta hanyar Wuri

source: Filter by Product
ha: Tace ta hanyar Kaya

source: Filter questions
ha: Tace tambayoyi

source: Finally, if you want to follow all news related to SUMO, don’t forget about our
ha: Daga ƙarshe, idan ka na so ka ci gaba da samun labarai da suka danganci SUMO, ka da ka manta da

source: Finally, if you want to follow all news related to SUMO, don’t forget about our <a href="%(forums_url)s">community forums</a>, <a href="%(blog_url)s">official blog</a> and <a href="%(twitter_url)s">Twitter account</a>. We also <a href="%(meetings_url)s"> meet almost every Monday </a> - and you can join us.
ha: Daga ƙarshe, idan ka na so ka bi duk labarai da suka danganci SUMO, ka da ka manta da <a href="%(forums_url)s">dandalin ƙungiya</a>, <a href="%(blog_url)s">blog na hukuma</a> and <a href="%(twitter_url)s">Asusun Twitter</a>. Kuma muna <a href="%(meetings_url)s"> taro kusan duk ranar Litinin </a> - kuma za ka iya haɗuwa da mu.

source: Find your fellow contributors
ha: Nemo abokinka mai bayar da gudun mawa

source: Firefox 29 Launch Team
ha: Ƙungiyar Ƙaddamarwa ta Firefox 29

source: Firefox controls and buttons
ha: Sarrafa Firefox da madannai

source: Firefox crashes
ha: Firefox ya yi karo

source: Firefox for Android
ha: Firefox domin Android

source: Firefox for iOS
ha: Firefox domin iOS

source: Firefox for iPhone, iPad and iPod touch devices
ha: Firefox domin iPhone, iPad na'urorin taɓawa

source: Firefox for Windows 8 Touch
ha: Firefox domin Windows 8 Touch

source: Firefox for Windows 8 touch devices
ha: Firefox domin na'urorin Windows 8 touch

source: Firefox Hello
ha: Barka da zuwa Firefox

source: Firefox is slow or stops working
ha: Firefox ba ta sauri ko ta daina aiki

source: Firefox options, preferences and settings
ha: Zaɓin Firefox, abubuwan da aka fi so da saituna

source: Firefox OS basics
ha: Ginshiƙan Firefox OS

source: Firefox OS SMS & email
ha: SMS & imel na Firefox OS

source: Firefox Releases
ha: Abubuwan saki na Firefox

source: Firefox Sync
ha: Saita Firefox

source: Firefox Sync settings
ha: Saita saitunan Firefox

source: Firefox version
ha: Yayin Firefox

source: Firefox versions and languages
ha: Yayin Firefox da yaruka

source: Firefox won't save settings or remember information
ha: Firefox ba zata ajiya saituna ba ko tuna bayani

source: Fix problems
ha: Magance matsaloli

source: Fix problems with email providers (gmail, Yahoo, etc.)
ha: Magance matsala tare da masu bayar da imel (gmail, Yahoo, etc.)

source: Fix problems with websites (Facebook, YouTube, webmail etc.)
ha: Yi maganin matsaloli tare da tashar yanar gizo (Facebook, YouTube, webmail etc.)

source: Fix slowness, crashing, error messages and other problems
ha: Gyara rashin sauri, karo, saƙwannin kuskure da sauran matsaloli

source: Flagged:
ha: An saka alamar tuta:

source: Flagged Content Pending Moderation
ha: Abin ciki Mai Alamar tuta Wanda ba'a Kammala Shiga Tsakani ba

source: Flagged {t} (Reason: {r})
ha: An saka alamar tuta {t} (Dalili: {r})

source: Flagging a user to ignore will prevent their tweets from showing up in Army of Awesome.
ha: Saka alamar tuta domin mai amfani ya yi watsi na iya hana tweets ɗinsu nunawa a Rudunar Burgewa.

source: Focus on people who need help or have questions
ha: Mayar da hankali kan mutane waɗan da ke neman taimako ko tambayoyi

source: Follow through. Sometimes, our volunteers would ask you for more information or to test out certain scenarios. The sooner you can do this, the sooner they would know how to fix it.
ha: Duba ciki. Wani lokaci, masu bayar da gudun mawarmu na iya tambayarka ƙarin bayani ko su jarraba wasu abubuwa da suka afku. Idan ka yi hakka cikin gaggawa za su san yadda za su maganceta cikin gaggawa.

source: For Contributors
ha: Domin masu bayar da Gudun mawa

source: Forgotten your password? Enter your email address below, and we'll send you instructions for setting a new one.
ha: Ka manta kalmar wucewarka? Shigar da adireshinka na imel a ƙasa, kuma za mu aiko maka da dokoki domin saita sabuwa.

source: Forgotten your username? Enter your email address below, and we'll send it to you.
ha: Ka manta da sunanka na mai amfani? Shigar da adireshinka na imel a ƙasa, kuma za mu aika shi gareka.

source: For help with writing articles, check out the <a href="%(url)s">Support Document Guide</a>.
ha: Domin taimako a kan rubuta maƙaloli, duba <a href="%(url)s">Jagoran Tallafin Daftari</a>.

source: Forum Contributor - Answer user support questions that are most-requested but have no replies:
ha: Mai bayar da gudun mawa na Dandali - Amsa tambayoyi na tallafin mai amfani waɗanda aka fi bukata amma ba su da amsoshi:

source: Found <strong>{n}</strong> result for <strong>{q}</strong> for <strong>{product}</strong>
ha: An sami <strong>{n}</strong> sakamako <strong>{q}</strong> na <strong>{product}</strong>

source: Free Download
ha: Saukewa Kyauta

source: From:
ha: Daga:

source: From %(from_input)s to %(to_input)s
ha: Daga %(from_input)s zuwa %(to_input)s

source: From hardcore web developers to "how do I install Firefox" first time users, everybody needs your help in the forum! Share your knowledge by pointing people to the right help articles and providing troubleshooting steps for their individual questions.
ha: Daga masu mayar da hankali kan haɓaka yanar gizo zuwa sababbin masu amfani na farko na "ta yaya zan saka Firefox", kowa yana bukatar taimako a dandalin! Raba iliminka ta nunawa mutane maƙalar da ta dace wadda za ta taimaka kuma ta bayar da matakai na warware matsala domin ɗaiɗaikun tambayoyinsu.

source: from the comfort of your couch
ha: daga jin daɗi na kan kujerarka

source: Full Article Sources
ha: Tushen Cikakkiyar Maƙala

source: general
ha: gaba ɗaya

source: Get community support
ha: Sami tallafin ƙungiya

source: Get emailed when there is new discussion activity in my locale.
ha: Sami saƙon imel idan an sami sabon aikin tattaunawa a wurin zama na.

source: Get email updates
ha: Sami sabuntawa imel

source: Get personal
ha: Sami na ƙashin kai

source: Get started
ha: Fara

source: Get support for another platform:
ha: Sami tallafi domin wani dandali:

source: Get the most from webmaker.org
ha: Sami mafi kyau daga webmaker.org

source: Give Firefox a tune up
ha: Bawa Firefox tsari

source: Give our users actionable and informed choices by informing and educating at the point of collection and providing a choice to opt-out whenever possible.
ha: Bawa masu amfani zaɓi na yin wani abu da kuma samun bayani ta sanar da su da kuma ilmantar da su lokacin karɓa kuma ka bayar da dama ta fita duk lokacin da zai yiwu.

source: Glad to hear it!
ha: Muna farin cikin jin haka!

source: Glad to hear it &mdash; thanks for the feedback!
ha: Mun yi farin cikin jin wannan &mdash; mun gode da amsarka!

source: Go
ha: Tafi

source: Go back to document history
ha: Koma baya zuwa tarihin daftari

source: Go back to the question.
ha: Koma zuwa tambayar.

source: Go back to the question and try again.
ha: Koma zuwa tambayar ka sake jarrabawa.

source: Go beyond the basics with these shortcuts and other tips.
ha: Tafi gaba da na asali ta waɗan nan gajerun hanyoyi da sauran shawarwari.

source: Go to Army of Awesome
ha: Jeka Rundunar Burgewa

source: Go to our support forum and choose a question to answer
ha: Jeka zuwa dandalinmu na tallafawa kuma ka zaɓi tambayar da za ka amsa

source: Go to the SUMO community discussions forum
ha: Jeka dandalin tattaunawa na al'ummar SUMO

source: Graphics
ha: Zane-zane

source: {group} | Groups
ha: {group} | Ƙungiyoyi

source: Group information updated successfully!
ha: An sami nasarar sabunta bayanin ƙungiya!

source: Group Leaders
ha: Jagororin Ƙungiya

source: Group Members
ha: Mambobin Ƙungiya

source: Groups
ha: Ƙungoyoyi

source: Recently awarded &quot;%(badge_name)s&quot; badges
ha: Kyautar kwanan nan &quot;%(badge_name)s&quot; badges

source: Has answers
ha: Yana da amsoshi

source: Has been sent a first answer contribution email.
ha: An aika da amsar farko ta bayar da gudun mawa ta imel.

source: Has been sent a first revision contribution email.
ha: An aika da amsar farko ga gudun mawar nazari ta imel.

source: Has helpful answers
ha: Yana amsoshi masu taimakawa

source: has this problem
ha: sa na da wannan matsala

source: Have a question about Army of Awesome?
ha: Akwai tambaya dangane da Rundunar Burgewa?

source: Have more to say?
ha: Me za'a faɗa?

source: Have video or voice conversations using the Firefox browser
ha: Sami bidiyo ko hirar murya ta amfani da mai gewayawa ta Firefox

source: Having an account on the support forums lets us notify you when you get a response on your question
ha: Samun asusun tallafin ƙungiya zai bamu dama mu sanar da kai lokacin da ka sami amsar tambayarka

source: Having trouble with a Mozilla product and want some help?
ha: Kana da matsala da kayayyakin Mozilla kuma ka na bukatar taimako?

source: Having trouble with Firefox and want some help? Our support forums are a great place to ask a question.
ha: Ka na samun matsala da Firefox kuma ka na bukatar taimako? Dandalinmu na taimakawa su ne mahimman wurare na tambayarka.

source: Heading 1
ha: Matashi na 1

source: Heading 2
ha: Matashi na 2

source: Heading 3
ha: Matashi na 3

source: Help articles are not available in your language yet? You want to join the amazing team translating them? You will help millions of users in your language. Pretty heroic, right?
ha: Babu maƙalolin taimako a yarenka tukuna? Kana so ka shiga ƙungiya mai ban mamaki su fassara shi? Za ka taimakawa miliyoyin masu amfani a yarenka. Ai akwai bajinta, ko?

source: Help Articles Only
ha: Maƙalolin Taimako Kawai

source: helpful
ha: mai taimakawa

source: Helpful
ha: Mai taimako

source: Helpfulness
ha: Taimako

source: Helpfulness of KB articles and Forum
ha: Taimakawar maƙalolin KB da Dandali

source: Helpful Reply
ha: Amsa Mai taimakawa

source: Helpful Solutions
ha: Mafita Mai taimakawa

source: Helpful votes
ha: Ƙuri'u masu taimakawa

source: Helpful Votes
ha: Ƙuri'u masu Taimakawa

source: Help millions of users get the most out of their favourite browser. Your contributions will reach millions of users worldwide, and you can do it from the comfort of your couch!
ha: Taimakawa miliyoyin masu amfani domin su ci moriya ta mai gewayawar da suka fi so. Gudun mawarku zai isa ga miliyoyin masu amfani a faɗin duniya, kuma za ka iya yinsa daga jin daɗi na kan kujerarka!

source: Help on Twitter
ha: Taimako a kan Twitter

source: Help or get help on a Webmaker project.
ha: Taimaka ka sami taimako daga aikin Webmaker.

source: Help other Firefox users by browsing for unsolved questions on {host}:
ha: Taimakawa sauran masu amfani ta gewayawa domin tambayoyin da ba'a amsa ba a {host}:

source: Help other users
ha: Taimakaw sauran masu amfani

source: Help Other Users
ha: Timakawa sauran masu amfani

source: Help teach digital skills and share creative ways of teaching technology.
ha: Taimaka ka koyar da ƙwarewa ta hanyar kwamfuta kuma ka raba hanyoyi na koyar da fasaha.

source: Help the Open Badges community
ha: Taimakawa ƙungiyar Buɗaɗɗun Bajuna

source: Help Topics
ha: Batutuwan Taimako

source: Help users in the forums
ha: Taimakawa masu amfani na dandalin

source: Help users on Twitter
ha: Taimakawa masu amfani a Twitter

source: Help us write help articles!
ha: Taimaka mana mu rubuta maƙalolin taimako!

source: Help Us Write Help Articles
ha: Taimaka mana mu Rubuta Maƙalolin Taimako

source: Help with:
ha: Taimaka da:

source: Hide details &raquo;
ha: Ɓoye cikakken bayani &raquo;

source: History
ha: Tarihi

source: History of {title}
ha: Tarihin {title}

source: Hi {username}
ha: Barka {username}

source: Hi {username},
ha: Barka {username},

source: Hot topics
ha: Batutuwa da ɗimi-ɗimi

source: How it works
ha: Yadda ya ke aiki

source: How to
ha: Yadda za'a

source: How To
ha: Yadda za'a

source: How to be effective:
ha: Yadda zai zama mai inganci:

source: How to configure and customize Firefox for Windows 8 Touch.
ha: Yadda za ka saita kuma ka tsara Firefox domin Windows 8 Touch.
